Revit 2026 API

# StructDeckEmbeddingType Enumeration

---

Used in class CompoundStructure to specify the usage of a layer whose function is StructuralDeck.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum StructDeckEmbeddingType
```
```vb
Public Enumeration StructDeckEmbeddingType
```
```cpp
public enum class StructDeckEmbeddingType
```
```fsharp
type StructDeckEmbeddingType
```

| Member name | Value | Description |
| --- | --- | --- |
| Invalid | -1 | Invalid usage. |
| MergeWithLayerAbove | 0 | Bound layer above. |
| Standalone | 1 | Standalone deck. |

#### Reference

Autodesk.Revit.DB Namespace